__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
protein (InputLayer)            (None, 1, 372, 21)   0                                            
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 1, 372, 64)   4032        protein[0][0]                    
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 1, 372, 64)   256         conv2d_1[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_1 (LeakyReLU)       (None, 1, 372, 64)   0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 1, 372, 64)   12288       leaky_re_lu_1[0][0]              
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 1, 372, 64)   256         conv2d_2[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_2 (LeakyReLU)       (None, 1, 372, 64)   0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 1, 186, 64)   0           leaky_re_lu_2[0][0]              
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 1, 186, 64)   0           max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 1, 186, 128)  24576       dropout_1[0][0]                  
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 1, 186, 128)  512         conv2d_3[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_3 (LeakyReLU)       (None, 1, 186, 128)  0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 1, 186, 128)  49152       leaky_re_lu_3[0][0]              
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 1, 186, 128)  512         conv2d_4[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_4 (LeakyReLU)       (None, 1, 186, 128)  0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 1, 93, 128)   0           leaky_re_lu_4[0][0]              
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 1, 93, 128)   0           max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 1, 93, 256)   98304       dropout_2[0][0]                  
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 1, 93, 256)   1024        conv2d_5[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_5 (LeakyReLU)       (None, 1, 93, 256)   0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 1, 93, 256)   196608      leaky_re_lu_5[0][0]              
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 1, 93, 256)   1024        conv2d_6[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_6 (LeakyReLU)       (None, 1, 93, 256)   0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 1, 46, 256)   0           leaky_re_lu_6[0][0]              
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, 1, 46, 256)   0           max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 1, 46, 512)   393216      dropout_3[0][0]                  
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 1, 46, 512)   2048        conv2d_7[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_7 (LeakyReLU)       (None, 1, 46, 512)   0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 1, 46, 512)   786432      leaky_re_lu_7[0][0]              
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 1, 46, 512)   2048        conv2d_8[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_8 (LeakyReLU)       (None, 1, 46, 512)   0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
max_pooling2d_4 (MaxPooling2D)  (None, 1, 23, 512)   0           leaky_re_lu_8[0][0]              
__________________________________________________________________________________________________
dropout_4 (Dropout)             (None, 1, 23, 512)   0           max_pooling2d_4[0][0]            
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 1, 23, 1024)  1572864     dropout_4[0][0]                  
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 1, 23, 1024)  4096        conv2d_9[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_9 (LeakyReLU)       (None, 1, 23, 1024)  0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 1, 23, 1024)  3145728     leaky_re_lu_9[0][0]              
__________________________________________________________________________________________________
ligand (InputLayer)             (None, 1, 9, 20)     0                                            
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 1, 23, 1024)  4096        conv2d_10[0][0]                  
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 1, 9, 64)     3840        ligand[0][0]                     
__________________________________________________________________________________________________
leaky_re_lu_10 (LeakyReLU)      (None, 1, 23, 1024)  0           batch_normalization_10[0][0]     
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 1, 9, 64)     256         conv2d_12[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_5 (MaxPooling2D)  (None, 1, 11, 1024)  0           leaky_re_lu_10[0][0]             
__________________________________________________________________________________________________
leaky_re_lu_12 (LeakyReLU)      (None, 1, 9, 64)     0           batch_normalization_12[0][0]     
__________________________________________________________________________________________________
dropout_5 (Dropout)             (None, 1, 11, 1024)  0           max_pooling2d_5[0][0]            
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 1, 9, 10)     640         leaky_re_lu_12[0][0]             
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 1, 9, 10)     30720       dropout_5[0][0]                  
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 1, 9, 10)     40          conv2d_13[0][0]                  
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 1, 9, 10)     40          conv2d_11[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_13 (LeakyReLU)      (None, 1, 9, 10)     0           batch_normalization_13[0][0]     
__________________________________________________________________________________________________
leaky_re_lu_11 (LeakyReLU)      (None, 1, 9, 10)     0           batch_normalization_11[0][0]     
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 1, 9, 20)     0           leaky_re_lu_13[0][0]             
                                                                 leaky_re_lu_11[0][0]             
__________________________________________________________________________________________________
zero_padding2d_1 (ZeroPadding2D (None, 1, 13, 20)    0           concatenate_1[0][0]              
__________________________________________________________________________________________________
locally_connected2d_1 (LocallyC (None, 1, 12, 512)   245760      zero_padding2d_1[0][0]           
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, 1, 12, 512)   2048        locally_connected2d_1[0][0]      
__________________________________________________________________________________________________
leaky_re_lu_14 (LeakyReLU)      (None, 1, 12, 512)   0           batch_normalization_14[0][0]     
__________________________________________________________________________________________________
max_pooling2d_6 (MaxPooling2D)  (None, 1, 6, 512)    0           leaky_re_lu_14[0][0]             
__________________________________________________________________________________________________
dropout_6 (Dropout)             (None, 1, 6, 512)    0           max_pooling2d_6[0][0]            
__________________________________________________________________________________________________
context_output (LocallyConnecte (None, 1, 5, 512)    2621440     dropout_6[0][0]                  
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, 1, 5, 512)    2048        context_output[0][0]             
__________________________________________________________________________________________________
leaky_re_lu_15 (LeakyReLU)      (None, 1, 5, 512)    0           batch_normalization_15[0][0]     
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 2560)         0           leaky_re_lu_15[0][0]             
__________________________________________________________________________________________________
dropout_7 (Dropout)             (None, 2560)         0           flatten_1[0][0]                  
__________________________________________________________________________________________________
dropout_9 (Dropout)             (None, 2560)         0           flatten_1[0][0]                  
__________________________________________________________________________________________________
regression_dense (Dense)        (None, 100)          256100      dropout_7[0][0]                  
__________________________________________________________________________________________________
classify_dense (Dense)          (None, 100)          256100      dropout_9[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_16 (LeakyReLU)      (None, 100)          0           regression_dense[0][0]           
__________________________________________________________________________________________________
leaky_re_lu_17 (LeakyReLU)      (None, 100)          0           classify_dense[0][0]             
__________________________________________________________________________________________________
dropout_8 (Dropout)             (None, 100)          0           leaky_re_lu_16[0][0]             
__________________________________________________________________________________________________
dropout_10 (Dropout)            (None, 100)          0           leaky_re_lu_17[0][0]             
__________________________________________________________________________________________________
regression_output (Dense)       (None, 1)            100         dropout_8[0][0]                  
__________________________________________________________________________________________________
classify_output (Dense)         (None, 1)            100         dropout_10[0][0]                 
==================================================================================================
Total params: 9,718,304
Trainable params: 9,708,152
Non-trainable params: 10,152
__________________________________________________________________________________________________